app/views/users/show.html.erb

<%end %>
<% if @user.results.length > 0 %>
---
SELECT  "results".* FROM "results" WHERE "results"."user_id" = $1 ORDER BY "results"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]