app/controllers/questions_controller.rb

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def load_pictures
    @survey = Survey.find_by(id: params[:survey_id])