app/controllers/results_controller.rb

  def create
  @result = Result.new
  @result.user_id = current_user.id
  @result.survey_id = params[:results][:survey_id]
  @result.answers =params[:results][:answers]
  @result.save
---
INSERT INTO "results" ("created_at", "updated_at", "user_id", "survey_id", "answers") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2018-01-09 20:56:01.826993"], ["updated_at", "2018-01-09 20:56:01.826993"], ["user_id", 1], ["survey_id", 1], ["answers", "{left,left,left,left}"]]