app/controllers/surveys_controller.rb

SELECT "surveys".* FROM "surveys"
---
def index
  @surveys =Survey.all

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @survey = Survey.find(params[:id])

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."survey_id" = $1 ORDER BY "questions"."id" ASC LIMIT $2  [["survey_id", 1], ["LIMIT", 1]]
---
  def load_pictures
    @survey = Survey.find_by(id: params[:survey_id])
    @pictures = []
    left_pic = HTTParty.get("https://api.giphy.com/v1/gifs/search?api_key=#{ENV["Giphy_Key"]}&q=#{@survey.questions[params[:number].to_i].option_a}&rating=g")