app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "phone", "privacy") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    if User.exists?(id: params[:id])
    @users = User.all
      @user = User.find(params[:id])
      unless current_user.user_matches.include?(@user) || @user ==current_user
        flash[:notice] = "You can only your matches profile."
        redirect_to new_session_path
      end
      if  @user.blocks.include?(current_user.id)
        flash[:notice] = "Cannot access profile.  You have been blocked."
        redirect_to user_matches_url(current_user.id)
      end
      if current_user.blocks.include?(@user.id)
        flash[:notice] = "Cannot access profile.  You have blocked this user."
        redirect_to user_matches_url(current_user.id)
      end
      @results = Result.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "results".* FROM "results" WHERE "results"."user_id" = $1 ORDER BY "results"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]