app/controllers/users_controller.rb

  def create
  @user = User.new
  @user.name = params[:user][:name]
  @user.email = params[:user][:email]
  @user.phone = params[:user][:phone]
  @user.privacy = params[:user][:privacy]
  @user.password = params[:user][:password]
  @user.password_confirmation = params[:user][:password_confirmation]

  if @user.save
    user = User.find_by(email: params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hi@notreal.com"], ["LIMIT", 1]]